package com.projectapp.lessons._5_Inheritance._4_Interface;

/**
 * РАСШИРЕНИЕ ИНТЕРФЕЙСОВ
 *
 * Ключевое слово extends позволяет одному интерфейсу наследовать другой
 * Синтаксис такого наследования аналогичен синтаксису наследования
 * классов.
 * Когда класс реализует интерфейс, наследующий другой интерфейс, он должен
 * предоставлять реализации всех методов, определенных по цепочке наследования
 * интерфейсов.
 */
public interface A7_ExtensionInterface_1 {
    void myFun1();
    void myFun2();
}
